[
  {
    "Name": "NimiraTech Speedster Board 2000",
    "Description": "A lightweight, responsive all-mountain board engineered for riders who want speed without sacrificing control. The Speedster 2000 features a reinforced core and precision edge profile, making it ideal for carving, fast descents, and confident handling on mixed terrain.",
    "Price": 200,
    "PictureUrl": "/images/products/nimiratech-speedster.png",
    "Type": "Boards",
    "Brand": "NimiraTech",
    "QuantityInStock": 68
  },
  {
    "Name": "NimiraTech Board 3000",
    "Description": "A versatile beginner-to-intermediate board designed for stability and easy progression. The Board 3000 offers a forgiving flex pattern and smooth turn initiation, perfect for riders building confidence on groomed runs.",
    "Price": 150,
    "PictureUrl": "/images/products/nimiratech-board.png",
    "Type": "Boards",
    "Brand": "NimiraTech",
    "QuantityInStock": 75
  },
  {
    "Name": "Morgana Board Speed Rush 3",
    "Description": "Built for aggressive riders, the Speed Rush 3 delivers explosive acceleration and sharp edge grip. Its directional shape and high-density core make it a strong performer on steep slopes and high-speed carving lines.",
    "Price": 180,
    "PictureUrl": "/images/products/morgana-speed-rush.png",
    "Type": "Boards",
    "Brand": "Morgana",
    "QuantityInStock": 3
  },
  {
    "Name": "Morgana Speed Board",
    "Description": "A premium performance board crafted for advanced riders seeking precision and power. The Morgana Speed Board combines a stiff flex with a race-inspired base for exceptional stability at high velocity.",
    "Price": 300,
    "PictureUrl": "/images/products/morgana-speed-board.png",
    "Type": "Boards",
    "Brand": "Morgana",
    "QuantityInStock": 52
  },
  {
    "Name": "Venom Super Board",
    "Description": "A bold, high-energy board designed for freestyle and all-mountain versatility. The Venom Super Board offers a lively flex and durable construction, making it ideal for park laps, jumps, and playful riding across varied terrain.",
    "Price": 250,
    "PictureUrl": "/images/products/venom-super-board.png",
    "Type": "Boards",
    "Brand": "Venom",
    "QuantityInStock": 97
  },
  {
    "Name": "Phantom Entry Board",
    "Description": "A reliable entry-level board built for comfort and control. The Phantom Entry Board features a soft flex and catch-free design, helping new riders learn turns, balance, and speed management with ease.",
    "Price": 120,
    "PictureUrl": "/images/products/phantom-entry-board.png",
    "Type": "Boards",
    "Brand": "Phantom",
    "QuantityInStock": 37
  },
  {
    "Name": "Blue Morgana Cap",
    "Description": "A warm, breathable winter cap made from soft-knit fibres. The Blue Morgana Cap provides everyday comfort on and off the slopes, with a snug fit that keeps heat in during cold mountain conditions.",
    "Price": 10,
    "PictureUrl": "/images/products/blue-morgana-cap.png",
    "Type": "Hats",
    "Brand": "Morgana",
    "QuantityInStock": 32
  },
  {
    "Name": "Green Skyline Beanie",
    "Description": "A lightweight, insulated beanie designed for active use. The Green Skyline Beanie offers moisture-wicking fabric and a low-profile fit, ideal for layering under helmets or wearing around the resort.",
    "Price": 8,
    "PictureUrl": "/images/products/green-skyline-beanie.png",
    "Type": "Hats",
    "Brand": "Skyline",
    "QuantityInStock": 6
  },
  {
    "Name": "Purple Phaser Cap",
    "Description": "A durable, fleece-lined cap offering excellent warmth in harsh winter weather. The Purple Phaser Cap combines comfort and style, making it a reliable choice for long days outdoors.",
    "Price": 15,
    "PictureUrl": "/images/products/purple-phaser-cap.png",
    "Type": "Hats",
    "Brand": "Phaser",
    "QuantityInStock": 17
  },
  {
    "Name": "Blue Skyline Gloves",
    "Description": "Insulated, weather-resistant gloves built for dependable warmth. The Blue Skyline Gloves feature reinforced palms and a flexible fit, ideal for recreational skiing and everyday winter use.",
    "Price": 18,
    "PictureUrl": "/images/products/blue-skyline-gloves.png",
    "Type": "Gloves",
    "Brand": "Skyline",
    "QuantityInStock": 74
  },
  {
    "Name": "Green Phaser Gloves",
    "Description": "A rugged pair of gloves designed for cold-weather performance. The Green Phaser Gloves offer strong grip, wind protection, and a comfortable inner lining for long-lasting wear.",
    "Price": 15,
    "PictureUrl": "/images/products/green-phaser-gloves.png",
    "Type": "Gloves",
    "Brand": "Phaser",
    "QuantityInStock": 19
  },
  {
    "Name": "Purple NimiraTech Gloves",
    "Description": "Technical winter gloves engineered for warmth and dexterity. The Purple NimiraTech Gloves use lightweight insulation and a water-resistant shell, making them suitable for both skiing and general outdoor activity.",
    "Price": 16,
    "PictureUrl": "/images/products/purple-nimiratech-gloves.png",
    "Type": "Gloves",
    "Brand": "NimiraTech",
    "QuantityInStock": 77
  },
  {
    "Name": "Green Aston Gloves",
    "Description": "A versatile glove set offering reliable insulation and durable construction. The Green Aston Gloves provide a secure fit and dependable grip, ideal for casual skiing and winter adventures.",
    "Price": 14,
    "PictureUrl": "/images/products/green-aston-gloves.png",
    "Type": "Gloves",
    "Brand": "Aston",
    "QuantityInStock": 45
  },
  {
    "Name": "Red NimiraTech Boots",
    "Description": "High-performance ski boots designed for responsive control and all-day comfort. The Red NimiraTech Boots feature an adjustable fit system and supportive shell, ideal for intermediate to advanced skiers.",
    "Price": 250,
    "PictureUrl": "/images/products/red-nimiratech-boots.png",
    "Type": "Boots",
    "Brand": "NimiraTech",
    "QuantityInStock": 49
  },
  {
    "Name": "Red Venom Boots",
    "Description": "A dynamic boot built for power and precision. The Red Venom Boots offer a firm flex and secure heel hold, giving confident skiers excellent stability on challenging terrain.",
    "Price": 189.99,
    "PictureUrl": "/images/products/red-venom-boots.png",
    "Type": "Boots",
    "Brand": "Venom",
    "QuantityInStock": 28
  },
  {
    "Name": "Purple Morgana Boots",
    "Description": "Comfort-focused ski boots with a balanced flex profile. The Purple Morgana Boots provide warmth, support, and easy entry, making them a great choice for progressing skiers.",
    "Price": 199.99,
    "PictureUrl": "/images/products/purple-morgana-boots.png",
    "Type": "Boots",
    "Brand": "Morgana",
    "QuantityInStock": 69
  },
  {
    "Name": "Purple Skyline Boots",
    "Description": "Lightweight, comfortable boots designed for recreational skiing. The Purple Skyline Boots offer a forgiving flex and cushioned liner, ideal for relaxed days on the mountain.",
    "Price": 150,
    "PictureUrl": "/images/products/purple-skyline-boots.png",
    "Type": "Boots",
    "Brand": "Skyline",
    "QuantityInStock": 35
  },
  {
    "Name": "Blue Venom Boots",
    "Description": "A performance-driven boot offering strong edge control and a snug, athletic fit. The Blue Venom Boots are built for skiers who want reliable responsiveness across varied snow conditions.",
    "Price": 180,
    "PictureUrl": "/images/products/blue-venom-boots.png",
    "Type": "Boots",
    "Brand": "Venom",
    "QuantityInStock": 27
  }
]